# Написати скрипт, який пройдеться по списку, який складається із кортежів, і замінить для кожного кортежа останнє значення.
# Список із кортежів можна захардкорити. Значення, на яке замінюється останній елемент кортежа вводиться користувачем.
# Значення, введене користувачем, можна ніяк не конвертувати (залишити рядком). Кількість елементів в кортежу повинна бути різна.
# Приклад списка кортежів: [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
# Очікуваний результат, якщо введено "100":
# Expected Output: [(10, 20, "100"), (40, 50, 60, "100"), (80, "100"), ("100",)]

d = str(input("Введіть значення для заміни: "))
l = [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
print([t[:-1] + (d,) for t in l])
